Словарь/src/DataProcessors/Тестирование/Тестирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Тестирование</name>
</mdclass:DataProcessor>

Словарь/src/Catalogs/Словарь/Словарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Словарь</name>
  <attributes>
    <name>ЗаписьНаЯпонском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСлова</name>
    <type>
      <types>EnumRef.ВидыСлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйСлог</name>
    <type>
      <types>CatalogRef.Слоги</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Слог</name>
      <type>
        <types>CatalogRef.Слоги</types>
      </type>
    </attributes>
    <attributes>
      <name>Запись</name>
      <type>
        <types>EnumRef.ВидыКаны</types>
      </type>
    </attributes>
    <attributes>
      <name>Канджи</name>
      <type>
        <types>CatalogRef.Канджи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоУдвоениеКанджи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/Catalogs/Канджи/Канджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Канджи</name>
  <attributes>
    <name>Юникод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮникодПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеЗначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Чтения</name>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>CatalogRef.ЧтенияКанджи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧтения</name>
      <type>
        <types>EnumRef.ВидыЧтенийКанджи</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/DataProcessors/Тестирование/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РежимТестирования = "Микс";	
	Уровень = "Легкий";
	КоличествоВопросов = 10;
	ИнициализироватьЭлементыФормы(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Тестирование(Команда)
	
	ТестированиеНаСервере();
	СледующийВопросНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СледующийВопрос(Команда)
	
	СледующийВопросНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьОтвет(Команда)
	УстановитьВидимостьВопроса(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСсылку(Команда)
	ПоказатьЗначение(, Ссылка);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТестированиеНаСервере()
	
	ЗаполнитьСписокВопросов();
	ИнициализироватьЭлементыФормы(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВопросов()
	
	Запрос = Новый Запрос;
	
	ТекстСловарь = 
	"ВЫБРАТЬ
	|	Словарь.Ссылка КАК Ссылка,
	|	Словарь.Наименование КАК Поле1,
	|	Словарь.ЗаписьНаЯпонском КАК Поле2,
	|	Словарь.Комментарий КАК Поле3
	|ИЗ
	|	Справочник.Словарь КАК Словарь
	|ГДЕ
	|	НЕ Словарь.ПометкаУдаления";
	
	ТекстКанджи =
	"ВЫБРАТЬ
	|	Канджи.Ссылка КАК Ссылка,
	|	Канджи.Наименование КАК Поле1,
	|	Канджи.ЮникодПредставление КАК Поле2,
	|	Канджи.ОсновноеЗначение КАК Поле3
	|ИЗ
	|	Справочник.Канджи КАК Канджи
	|ГДЕ
	|	НЕ Канджи.ПометкаУдаления";
		
	Если РежимТестирования = "Словарь" Тогда
		Запрос.Текст = ТекстСловарь;
	ИначеЕсли РежимТестирования = "Канджи" Тогда
		Запрос.Текст = ТекстКанджи;
	Иначе
		Запрос.Текст = СтрШаблон(
		"%1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|%2", ТекстСловарь, ТекстКанджи);
	КонецЕсли;
	
	Вопросы.Загрузить(Запрос.Выполнить().Выгрузить());
	ПеремешатьВопросы();
	
КонецПроцедуры

&НаСервере
Процедура ПеремешатьВопросы()
	
	МассивСтрок = Новый Массив;
	Для Каждого Стр Из Вопросы Цикл
		МассивСтрок.Добавить(Стр);
	КонецЦикла;
	
	Длина = МассивСтрок.ВГраница();
	Генератор = Новый ГенераторСлучайныхЧисел;
	Для Индекс = 0 По Длина Цикл
		ИндексПеремещения = Генератор.СлучайноеЧисло(0, Длина);
		Временный = МассивСтрок[Индекс];
		МассивСтрок[Индекс] = МассивСтрок[ИндексПеремещения];
		МассивСтрок[ИндексПеремещения] = Временный;
	КонецЦикла;
	
	Вопросы.Очистить();
	Для Каждого Стр Из МассивСтрок Цикл
		НоваяСтрока = Вопросы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьЭлементыФормы(ВидимостьШапки)
	
	ИндексТекущегоВопроса = 0;
	Элементы.ГруппаШапка.Видимость = ВидимостьШапки;
	Элементы.ГруппаДанныеТеста.Видимость = НЕ ВидимостьШапки;
	Элементы.ГруппаКомандыТеста.Видимость = НЕ ВидимостьШапки;
	
КонецПроцедуры

&НаКлиенте
Процедура СледующийВопросНаКлиенте()
	Если ИндексТекущегоВопроса = КоличествоВопросов Тогда
		ИнициализироватьЭлементыФормы(Истина);
	КонецЕсли;
	
	ИндексТекущегоВопроса = ИндексТекущегоВопроса + 1;
	Если ИндексТекущегоВопроса = КоличествоВопросов Тогда
		Элементы.СледующийВопрос.Заголовок = "Завершить";
	Иначе
		Элементы.СледующийВопрос.Заголовок = "Далее";
	КонецЕсли;
	
	УстановитьВидимостьВопроса(Ложь);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВопроса(ВидимостьОтвета)
	
	ТекущийВопрос = Вопросы[ИндексТекущегоВопроса - 1];
	
	Поле1 = ТекущийВопрос.Поле1;
	Поле2 = ТекущийВопрос.Поле2;
	Поле3 = ТекущийВопрос.Поле3;
	Ссылка = ТекущийВопрос.Ссылка;
	Элементы.ПосмотретьОтвет.Видимость = НЕ ВидимостьОтвета;
	Элементы.ОткрытьСсылку.Доступность = ВидимостьОтвета;
	
	Если ВидимостьОтвета Тогда
		Возврат;
	КонецЕсли;
	
	Генератор = Новый ГенераторСлучайныхЧисел;
	СлучайноеЧисло = Генератор.СлучайноеЧисло(1, 3);
	Если Уровень = "Легкий" Тогда
		ЭтотОбъект["Поле" + СлучайноеЧисло] = "?????"
	Иначе
		Поле1 = "?????";
		Поле2 = "?????";
		Поле3 = "?????";
		ЭтотОбъект["Поле" + СлучайноеЧисло] = ТекущийВопрос["Поле" + СлучайноеЧисло];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
